; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	image1 - mode
	thermograph0 - mode
	Star4 - direction
	GroundStation6 - direction
	GroundStation9 - direction
	GroundStation12 - direction
	GroundStation3 - direction
	GroundStation7 - direction
	Star1 - direction
	Star10 - direction
	Star5 - direction
	Star8 - direction
	GroundStation0 - direction
	Star11 - direction
	GroundStation2 - direction
	Planet13 - direction
	Star14 - direction
	Planet15 - direction
	Planet16 - direction
	Planet17 - direction
	Star18 - direction
	Planet19 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation7)
	(calibration_target instrument0 GroundStation3)
	(calibration_target instrument0 Star10)
	(supports instrument1 image1)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 GroundStation2)
	(calibration_target instrument1 Star8)
	(calibration_target instrument1 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet15)
	(supports instrument2 image1)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 Star5)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star5)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 GroundStation0)
	(calibration_target instrument3 GroundStation2)
	(calibration_target instrument3 Star8)
	(supports instrument4 thermograph0)
	(supports instrument4 image1)
	(calibration_target instrument4 Star8)
	(calibration_target instrument4 Star5)
	(calibration_target instrument4 Star10)
	(supports instrument5 thermograph0)
	(supports instrument5 image1)
	(calibration_target instrument5 GroundStation2)
	(calibration_target instrument5 Star11)
	(calibration_target instrument5 GroundStation0)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet19)
)
(:goal (and
	(pointing satellite0 Planet17)
	(have_image Planet13 thermograph0)
	(have_image Star14 thermograph0)
	(have_image Planet15 image1)
	(have_image Planet16 image1)
	(have_image Planet17 image1)
	(have_image Star18 image1)
	(have_image Planet19 thermograph0)
))

)

; plan
1. (turn_to satellite0 groundstation3 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 groundstation3)
   goals met: 0 of 8
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 8
3. (calibrate satellite0 instrument0 groundstation3)
   added: (calibrated instrument0)
   goals met: 0 of 8
4. (turn_to satellite0 planet16 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 planet16)
   goals met: 0 of 8
5. (take_image satellite0 planet16 instrument0 image1)
   added: (have_image planet16 image1)
   goals met: 1 of 8
6. (turn_to satellite0 planet15 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 planet15)
   goals met: 1 of 8
7. (take_image satellite0 planet15 instrument0 image1)
   added: (have_image planet15 image1)
   goals met: 2 of 8
8. (turn_to satellite0 planet13 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 planet13)
   goals met: 2 of 8
9. (take_image satellite0 planet13 instrument0 thermograph0)
   added: (have_image planet13 thermograph0)
   goals met: 3 of 8
10. (turn_to satellite0 planet19 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 planet19)
   goals met: 3 of 8
11. (take_image satellite0 planet19 instrument0 thermograph0)
   added: (have_image planet19 thermograph0)
   goals met: 4 of 8
12. (turn_to satellite0 star14 planet19)
   deleted: (pointing satellite0 planet19)
   added: (pointing satellite0 star14)
   goals met: 4 of 8
13. (take_image satellite0 star14 instrument0 thermograph0)
   added: (have_image star14 thermograph0)
   goals met: 5 of 8
14. (turn_to satellite0 star18 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star18)
   goals met: 5 of 8
15. (take_image satellite0 star18 instrument0 image1)
   added: (have_image star18 image1)
   goals met: 6 of 8
16. (turn_to satellite0 planet17 star18)
   deleted: (pointing satellite0 star18)
   added: (pointing satellite0 planet17)
   goals met: 7 of 8
17. (take_image satellite0 planet17 instrument0 image1)
   added: (have_image planet17 image1)
   goals met: 8 of 8
